# ConnectorType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..ConnectorType Property
Connector Class See Also
---
The connector type of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorType ConnectorType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorType As ConnectorType
	Get
```

Visual C++
---
```text
public:
property ConnectorType ConnectorType {
	ConnectorType get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace